<?php
// Подключаем все сервисы и иницилиализируем их работу

/*
|--------------------------------------------------------------------------
| Настройка псевдонимов
|--------------------------------------------------------------------------
|
| Читает файл конфигурации (config / aliases.php) и создает псевдонимы
|
*/
Core\Alias::init();

/*
|--------------------------------------------------------------------------
| Установите часовой пояс по умолчанию
|--------------------------------------------------------------------------
|
| Читает файл конфигурации (config / datetime.php) и устанавливает часовой пояс
|
*/
TimeTrackr::init();

/*
|--------------------------------------------------------------------------
| Создание Синглтона
|--------------------------------------------------------------------------
|
| Используем Синглтон для упрощения координации
|
*/
$app = new App;

/*
|--------------------------------------------------------------------------
| Связывание с коннектором базы данных
|--------------------------------------------------------------------------
|
| Подключите базу данных только один раз. Спаси планету.
|
*/
$app->link('database', Database::connect());

/*
|--------------------------------------------------------------------------
| Запуск двигателя кэширования
|--------------------------------------------------------------------------
|
| Это моя любимая часть. Минимизирую использование ресурсов, максимизирую
| возможности.
|
*/
$app->link('cachemanager', Cache::init());

/*
|--------------------------------------------------------------------------
| Сервисы загрузки
|--------------------------------------------------------------------------
|
| Именно здесь загружаются все ваши приложения в / app / Service.
|
*/
$service = Service::loadServices();

/*
|--------------------------------------------------------------------------
| Поделитесь приложением и сервисом с Синглтоном
|--------------------------------------------------------------------------
|
| Устранить сложность, получить работу. Наша инъекция зависимостей (DI)
| здесь!
|
*/
Sharer::share('app', $app);
Sharer::share('service', $service);

/*
|--------------------------------------------------------------------------
| Отправляем маршрутизатор
|--------------------------------------------------------------------------
|
| Та Да! Мы можем что-то увидеть сейчас!
|
*/

Router::start();
Router::dispatch();

/*
|--------------------------------------------------------------------------
| Показать время выполнения
|--------------------------------------------------------------------------
|
| Покажите время, необходимое для завершения выполнения задачи. (См. Файл
| config/env.php)
|
*/
if(getenv('SHOW_EXECUTION_TIME')){
    Debugger::exec_time();
}
